"use strict";

// Конструкція switch може замінити кілька if.

// Вона дає можливість більш наочного способу порівняння значення відразу з кількома варіантами.

// І if/else ifоператори, і switch оператор є структурами потоку керування в JavaScript, які використовуються для прийняття рішень на основі різних умов. Хоча вони служать подібним цілям, вони мають різні варіанти використання та переваги:

// Гнучкість : if/else if оператори є більш гнучкими та можуть працювати з широким діапазоном умов. Вони дозволяють перевіряти складні умови за допомогою різноманітних операторів порівняння (наприклад, ===, >, <тощо), логічних операторів ( &&, ||, !) і спеціальних функцій. Ви також можете вкладати if/else оператори, щоб створювати більш складні процеси прийняття рішень.
// Порівняння : це switch твердження в основному використовується для простих порівнянь на основі цінностей. Він обчислює вираз один раз, а потім порівнює отримане значення з кількома реченнями case. Він не підтримує складні умови чи діапазони значень у кожному випадку.
// Читабельність : switch оператор може зробити код більш читабельним і організованим під час обробки серії рівностей щодо однієї змінної. Це особливо корисно при роботі з великою кількістю справ.
// Продуктивність : у деяких випадках switch оператор може бути швидшим, ніж довгі ланцюжки if/else if операторів, коли є кілька випадків і можна знайти пряму відповідність без необхідності оцінювати кожну умову.

// Використовуйте if/else if оператори, коли вам потрібно перевірити складні умови або оцінити кілька умов у певному порядку.
// Використовуйте цей switch оператор, коли у вас є просте порівняння на основі значення з кількома випадками, і кожен випадок прямо збігається з однією змінною.

// Інструкції Switch не можуть включати порівняння. Наприклад, перевірити, чи одна змінна є істинною, а інша – хибною, чи одне число більше іншого.

// Перемикачі призначені для перевірки однієї змінної, яка може бути в одному з багатьох станів.

//! sintacsis
// switch(x) {
//     case 'value1':
//         ...
//     break;

//     case 'value2':
//         ...
//     break;

//     default:
//         ...
//     break;
// }

// example

const a = 6;
switch (a) {
  case 3:
    console.log("not correct");
    break;
  case 4:
    console.log("top");
    break;
  case 5:
    console.log("too much");
    break;
  default:
    console.log("ye ztat takogo");
    break;
}

const b = 3;

switch (b) {
  case 4:
    console.log("top");
    break;
  case 3:
  case 5:
    console.log("ne top");
    break;
  default:
    console.log("hmmmm");
    break;
}

// тип має значення

const arg = "0";

switch (arg) {
  case "0":
  case "1":
    console.log("1 or 0");
    break;
  case '2':
    console.log("two");
    break;
  case 3:
    console.log('noooo');
    break;
  default:
    console.log('undef num');
    break;    
}




// ====
const valueA = 6; 

// if (true) {
//     const value = 5;
//     console.log(value);
//     console.log(valueA);
// }
// console.log(value);


function typeW() {
    const p = "value";
    if (true) {
        const a = 67;
        console.log(p);
        console.log(valueA);
        console.log(a);
    }

    console.log(a);
    console.log(p);


}

typeW()



// Напиши скрипт вибору опції доставки товару. Опція зберігається в змінній option: 1 - самовивіз, 2 - кур"єр, 3 - пошта. В змінну message записати повідомлення в залежності від опції.
// - 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
// - 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'
// - 'Посилка буде відправлена сьогодні'
// - 'Вам передзвонит менеджер'.
// Напиши скрипт вибору готеля по кількості зірок.


const option = +prompt('choose option: 1 - самовивіз, 2 - кур"єр, 3 - пошта.');
let message;
switch(option) {
    case 1:
        message = 'Кур"єр доставить замовлення завтра з 9:00 до 18:00';
        break;
    case 2:
        message = 'Ви зможете забрати товар завтра з 12:00 в нашому офісі';
        break; 
        
    case 3:
        message = 'Посилка буде відправлена сьогодні';
        break;
    default:
        message = 'Вам передзвонит менеджер';
        break;        
}
alert(message)



// Якщо ваше ім’я містить більше 4 букв і прізвище більше 5, то виведіть на екран число,яке дорівнює сумі букв імені і прізвища. Якщо умова не виконується - вивести “УПС”. Наприклад: “Віктор Сташко” Віктор - 6 літер, Сташко - 6 літер. Виводимо 12. Використовувати вбудований метод length

const name = "andrii";
const lastName = 'loskucherevii';

if (name.length > 4 && lastName.length > 5) {
    sum = lastName.length + name.length
    console.log(sum);
}else {
    console.log('upsss');
}
